In [ ]:
# Topics to complete-
# (1) Statistical Functions
# (2) Data Transformations

In [1]:
# Importing important libraries
import pandas as pd
import numpy as np

In [2]:
# Importing the dataset
df = pd.read_csv('Octane.csv')
df.head()

   Sample  Material1  Material2  Material3  Condition  Octane
0       1      55.33       1.72         54    1.66219   92.19
1       2      59.13       1.20         53    1.58399   92.74
2       3      57.39       1.42         55    1.61731   91.88
3       4      56.43       1.78         55    1.66228   92.80
4       5      55.98       1.58         54    1.63195   92.56

In [3]:
# Calculating mean for Material1, Material2, Material3, Condition and Octane columns
m1_mean = df['Material1'].mean()
m2_mean = df['Material2'].mean()
m3_mean = df['Material3'].mean()
cond_mean = df['Condition'].mean()
octane_mean = df['Octane'].mean()
print('Mean value for Material 1 is : ', m1_mean)
print('Mean value for Material 2 is : ', m2_mean)
print('Mean value for Material 3 is : ', m3_mean)
print('Mean value for Condition is : ', cond_mean)
print('Mean value for Octane is : ', octane_mean)

Mean value for Material 1 is :  60.17060975609757
Mean value for Material 2 is :  1.663658536585366
Mean value for Material 3 is :  55.46341463414634
Mean value for Condition is :  1.6265713414634146
Mean value for Octane is :  91.84987804878045

In [4]:
# Calculating median for Material1, Material2, Material3, Condition and Octane columns
m1_mdn = df['Material1'].median()
m2_mdn = df['Material2'].median()
m3_mdn = df['Material3'].median()
cond_mdn = df['Condition'].median()
octane_mdn = df['Octane'].median()
print('Median value for Material 1 is : ', m1_mdn)
print('Median value for Material 2 is : ', m2_mdn)
print('Median value for Material 3 is : ', m3_mdn)
print('Median value for Condition is : ', cond_mdn)
print('Median value for Octane is : ', octane_mdn)

Median value for Material 1 is :  62.695
Median value for Material 2 is :  1.28
Median value for Material 3 is :  56.0
Median value for Condition is :  1.6035750000000002
Median value for Octane is :  91.735

In [5]:
# Calculating mode for Material1, Material2, Material3, Condition and Octane columns
m1_mde = df['Material1'].mode()
m2_mde = df['Material2'].mode()
m3_mde = df['Material3'].mode()
cond_mde = df['Condition'].mode()
octane_mde = df['Octane'].mode()
print('Mode value for Material 1 is : ', m1_mde)
print('Mode value for Material 2 is : ', m2_mde)
print('Mode value for Material 3 is : ', m3_mde)
print('Mode value for Condition is : ', cond_mde)
print('Mode value for Octane is : ', octane_mde)

Mode value for Material 1 is :  0      4.23
1      5.53
2     17.11
3     44.64
4     44.66
      ...
77    72.30
78    72.66
79    73.13
80    73.74
81    75.54
Length: 82, dtype: float64
Mode value for Material 2 is :  0    0.0
dtype: float64
Mode value for Material 3 is :  0    55
dtype: int64
Mode value for Condition is :  0     1.19975
1     1.20817
2     1.26174
3     1.28802
4     1.29842
       ...
77    2.08081
78    2.14314
79    2.17070
80    2.17140
81    2.31909
Length: 82, dtype: float64
Mode value for Octane is :  0    91.56
1    91.61
2    92.16
dtype: float64

In [6]:
# Calculating count() for Material1, Material2, Material3, Condition and Octane columns
m1_cnt = df['Material1'].count()
m2_cnt = df['Material2'].count()
m3_cnt = df['Material3'].count()
cond_cnt = df['Condition'].count()
octane_cnt = df['Octane'].count()
print('Count for Material 1 is : ', m1_cnt)
print('Count for Material 2 is : ', m2_cnt)
print('Count for Material 3 is : ', m3_cnt)
print('Count for Condition is : ', cond_cnt)
print('Count for Octane is : ', octane_cnt)

Count for Material 1 is :  82
Count for Material 2 is :  82
Count for Material 3 is :  82
Count for Condition is :  82
Count for Octane is :  82

In [7]:
# Printing the shape of df
print(df.shape)

(82, 6)

In [ ]:
# unique() : gives you unique values.
# nunique() : gives you number of rows with unique values.

In [8]:
# Calculating standard deviation for Material1, Material2, Material3, Condition and Octane columns
m1_std = df['Material1'].std()
m2_std = df['Material2'].std()
m3_std = df['Material3'].std()
cond_std = df['Condition'].std()
octane_std = df['Octane'].std()
print('Standard Deviation for Material 1 is : ', m1_std)
print('Standard Deviation for Material 2 is : ', m2_std)
print('Standard Deviation for Material 3 is : ', m3_std)
print('Standard Deviation for Condition is : ', cond_std)
print('Standard Deviation for Octane is : ', octane_std)

Standard Deviation for Material 1 is :  12.43739992552937
Standard Deviation for Material 2 is :  1.9019518968064713
Standard Deviation for Material 3 is :  5.377582921059387
Standard Deviation for Condition is :  0.2197298227524435
Standard Deviation for Octane is :  1.4011243226995749

In [9]:
# Calculating minimum for Material1, Material2, Material3, Condition and Octane columns
m1_min = df['Material1'].min()
m2_min = df['Material2'].min()
m3_min = df['Material3'].min()
cond_min = df['Condition'].min()
octane_min = df['Octane'].min()
print('Minimum for Material 1 is : ', m1_min)
print('Minimum for Material 2 is : ', m2_min)
print('Minimum for Material 3 is : ', m3_min)
print('Minimum for Condition is : ', cond_min)
print('Minimum for Octane is : ', octane_min)

Minimum for Material 1 is :  4.23
Minimum for Material 2 is :  0.0
Minimum for Material 3 is :  40
Minimum for Condition is :  1.19975
Minimum for Octane is :  89.66

In [10]:
# Calculating maximum for Material1, Material2, Material3, Condition and Octane columns
m1_max = df['Material1'].max()
m2_max = df['Material2'].max()
m3_max = df['Material3'].max()
cond_max = df['Condition'].max()
octane_max = df['Octane'].max()
print('Maximum for Material 1 is : ', m1_max)
print('Maximum for Material 2 is : ', m2_max)
print('Maximum for Material 3 is : ', m3_max)
print('Maximum for Condition is : ', cond_max)
print('Maximum for Octane is : ', octane_max)

Maximum for Material 1 is :  75.54
Maximum for Material 2 is :  10.76
Maximum for Material 3 is :  64
Maximum for Condition is :  2.31909
Maximum for Octane is :  97.61

In [13]:
# Getting all the statistical parameters in one command
df.describe()

          Sample  Material1  Material2  Material3  Condition     Octane
count  82.000000   82.00000  82.000000  82.000000  82.000000  82.000000
mean   41.500000   60.17061   1.663659  55.463415   1.626571  91.849878
std    23.815261   12.43740   1.901952   5.377583   0.219730   1.401124
min     1.000000    4.23000   0.000000  40.000000   1.199750  89.660000
25%    21.250000   55.38000   0.105000  54.000000   1.518095  90.847500
50%    41.500000   62.69500   1.280000  56.000000   1.603575  91.735000
75%    61.750000   67.78000   2.277500  59.750000   1.722818  92.467500
max    82.000000   75.54000  10.760000  64.000000   2.319090  97.610000

In [ ]:
# Data Transformations

In [25]:
# Importing new dataset
df = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv',index_col=0)
df.head()

            Age  Gender      Grade Employed
Student_id
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no

In [26]:
# Command to include and exclude columns of numeric data type
df_numeric = df.select_dtypes(include = [np.number])
df_numeric.head()

            Age
Student_id
1            19
2            20
3            18
4            21
5            19

In [27]:
# Command to include and exclude columns of numeric data type
df_categorical = df.select_dtypes(exclude = [np.number])
df_categorical.head()

            Gender      Grade Employed
Student_id
1             Male  1st Class      yes
2           Female  2nd Class       no
3             Male  1st Class       no
4           Female  2nd Class       no
5             Male  1st Class       no

In [28]:
# Getting unique values from Material 3 column
print(df['Grade'].unique())

['1st Class' '2nd Class' '3rd Class']

In [29]:
# Getting number of unique values from Material 3 column
print(df['Grade'].nunique())

3

In [30]:
# Getting the proportion of categories from categorical columns
df['Grade'].value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [31]:
# Getting the proportion of categories from categorical columns
df['Gender'].value_counts()

Male      136
Female     96
Name: Gender, dtype: int64

In [33]:
# Getting the proportion of categories from categorical columns
df['Employed'].value_counts()

no     133
yes     99
Name: Employed, dtype: int64

In [35]:
# Replacing some values
df['Gender'].replace({'Male' : 0, 'Female' : 1}, inplace = True)
df['Employed'].replace({'no' : 0, 'yes' : 1}, inplace = True)
df['Grade'].replace({'1st Class' : 1, '2nd Class' : 2, '3rd Class' : 3}, inplace = True)
df.head()

            Age  Gender  Grade  Employed
Student_id
1            19       0      1         1
2            20       1      2         0
3            18       0      1         0
4            21       1      2         0
5            19       0      1         0

In [36]:
# Basic Data Transformation
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns = ['a','b','c'])
df.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [37]:
# Applying a small transformation
df.transform(func = lambda x : x*10)

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [39]:
# Applying a small transformation
df.transform(func = lambda x : np.log(x))

          a         b         c
0  0.000000  0.693147  1.098612
1  1.386294  1.609438  1.791759
2  1.945910  2.079442  2.197225

In [40]:
# Applying a small transformation
df.transform(func = lambda x : np.exp(x))

             a            b            c
0     2.718282     7.389056    20.085537
1    54.598150   148.413159   403.428793
2  1096.633158  2980.957987  8103.083928